#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jeff-spradlin-org/azure-demo-aks/runs/run-E9Mcq3fpHjyrdFpE

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.aks.null_resource.kubernetes_version_keeper: Refreshing state... [id=8213172233604024781]
azurerm_resource_group.rg01: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01]
azurerm_subnet.subnets["internal01"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/internal01]
azurerm_subnet.subnets["ingress"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/ingress]
azurerm_subnet.subnets["private_link"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/private_link]
azurerm_subnet.subnets["app_gateway_front_end"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/app_gateway_front_end]
azurerm_subnet.subnets["internal02"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/internal02]
azurerm_subnet.subnets["default_node_pool"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/default_node_pool]
azurerm_subnet.subnets["app_gateway_back_end"]: Refreshing state... [id=/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/app_gateway_back_end]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "dev-azure-aks-01"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "dev-azure-aks-01"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "dev-azure-aks-01"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/eb8ea927-e979-4441-a05b-78500bb5cbe6/resourceGroups/dev-azure-aks-01/providers/Microsoft.Network/virtualNetworks/lab01/subnets/default_node_pool"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aks.null_resource.kubernetes_version_keeper will be destroyed
  - resource "null_resource" "kubernetes_version_keeper" {
      - id       = "8213172233604024781" -> null
      - triggers = {
          - "version" = null
        } -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 1 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @jmspradlin, Action: `pull_request`*